OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.2274/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.586403950235107 0 -8.103557750130614)
	(21.87960592535266 0 -8.103557750130614)
	(21.87960592535266 9.116502468896941 -8.103557750130614)
	(-14.586403950235107 9.116502468896941 -8.103557750130614)
	(-14.586403950235107 0 3.798542695373725)
	(21.87960592535266 0 3.798542695373725)
	(21.87960592535266 9.116502468896941 3.798542695373725)
	(-14.586403950235107 9.116502468896941 3.798542695373725)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (144 36 47) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

